QUESTIONS = [
    {
        "text": "各ラウンドで2人のプレイヤー間で分けられる実験通貨単位（ECU）の合計額はいくらですか？",
        "options": ["A) 500ECU", "B) 1000ECU", "C) 750ECU", "D) 1500ECU"],
        "correct_answer": "B) 1000ECU",
        "explanation": "各ラウンドで、プレイヤーは合計1000ECUを自分たちで分けることになります。"
    },
    {
        "text": "プレイヤーが与えられた時間内に合意に達しない場合はどうなりますか？",
        "options": ["A) 報酬は受け取れない", "B) 別のタイマーが始まる", "C) 報酬はランダムに決定される", "D) 不合意ステージでの結果で定まる"],
        "correct_answer": "D) 不合意ステージでの結果で定まる",
        "explanation": "不合意ステージに移動し、そこで指示された結果になります。"
    },
    {
        "text": "各ラウンドで、ペアの相手とプレイヤーの役割 (プレイヤー1か2) はどのように決定されますか？",
        "options": ["A) 相手も役割も変わりません。", "B) 相手はランダムに変わりますが、役割は変わりません。", "C) 相手は変わりませんが、役割はランダムに変わります。", "D) 相手も役割もランダムに変わります。", "E) 相手はランダムに変わります。役割は初めの4ラウンドと後の4ラウンドで変わります。"],
        "correct_answer": "E) 相手はランダムに変わります。役割は初めの4ラウンドと後の4ラウンドで変わります。",
        "explanation": "ペアの相手は、各ラウンドごとにランダムに変わり、同じ相手とペアになることはありません。プレイヤーの役割は、初めの4ラウンドでプレイヤー1だった人は、後の4ラウンドでプレイヤー2となります。同様に、初めの4ラウンドでプレイヤー2だった人は、後の4ラウンドでプレイヤー1となります。"
    },
    {
        "text": "プレイヤーは一度オファーを行った後、そのオファーを変更することができますか？",
        "options": ["A) いいえ、提案は最終的なものです", "B) はい、一度だけ変更できます", "C) はい、好きなだけ何度でも変更できます", "D) はい、ただし相手プレイヤーが同意した場合のみ変更できます"],
        "correct_answer": "C) はい、好きなだけ何度でも変更できます",
        "explanation": "プレイヤーは交渉中に何度でも新しい提案を作成しオファーすることができます。"
    },
    {
        "text": "一方のプレイヤーが交渉を中止することを選択した場合、どうなりますか？",
        "options": ["A) ラウンドは即座に終了し、そのラウンドの報酬はない", "B) もう一方のプレイヤーが停止するかどうかの最終決定を行う", "C) 中止の選択は無視され、時間制限まで交渉が続く", "D) 不合意ステージに移動する"],
        "correct_answer": "D) 不合意ステージに移動する",
        "explanation": "プレイヤーが交渉を中止することを選択した場合、交渉は終了して不合意ステージに移動し、ステージでの指示に従った後、そのラウンドが終了します。"
    },
    {
        "text": "プレイヤーによって行われた決定やオファーは匿名ですか？",
        "options": ["A) はい、完全に匿名です", "B) いいえ、すべての決定やオファーが他の参加者に公開されます", "C) オファーのみが匿名です", "D) 決定のみが匿名です"],
        "correct_answer": "A) はい、完全に匿名です",
        "explanation": "ゲーム中に行われるすべての決定やオファーは、他の参加者には知られません。"
    },
    {
        "text": "各プレイヤーによってオファーされた金額の合計額が1000と等しくない場合はどうなりますか？",
        "options": ["A) オファーは自動的に受け入れられる", "B) そのラウンドの交渉が終了する", "C) そのオファーをしたプレイヤーは罰せられる", "D) 合計額1000の提案が行われるまで交渉が続く"],
        "correct_answer": "D) 合計額1000の提案が行われるまで交渉が続く",
        "explanation": "合計金額が1000にならない提案は無効と見なされ、プレイヤーは有効な提案を行い、交渉を続ける必要があります。"
    },
    {
        "text": "プレイヤーは交渉過程で互いにコミュニケーションを取ることができますか？",
        "options": ["A) いいえ、コミュニケーションは許可されていません", "B) はい、しかし交渉ステージの前にのみ可能です", "C) はい、交渉ステージ中にのみ、チャット機能を通じて可能です"],
        "correct_answer": "C) はい、交渉ステージ中にのみ、チャット機能を通じて可能です",
        "explanation": "交渉ステージではチャット機能が利用可能で、必要に応じて自由に使用できます。"
    }]
